Eindhoven_51.44844_5.46475_dir100/100/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
        version     2.0;
        format ascii;
        class dictionary;
        object controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs
(
        "libOpenFOAM.so"
        "libutilityFunctionObjects.so"
        "libsolverFunctionObjects.so"
);
            application simpleFoam;
            startFrom latestTime;
            startTime       1;
            stopAt endTime;
            endTime         5000;
            deltaT          1;
            writeControl timeStep;
            writeInterval   100;
            purgeWrite      3;
            writeFormat binary;
            writePrecision  8;
            writeCompression uncompressed;
            timeFormat general;
            timePrecision   6;
            runTimeModifiable true;
            functions
{
#includeFunc residuals
pressureCoefficients
{
                    type pressure;
                    libs ("libfieldFunctionObjects.so");
                    enabled true;
                    writeControl timeStep;
                    writeInterval 100;
                    UInf (-4.924 0.868 0);     // the undistrubed velocity at building height
                    pInf 15;        // the dynamic undisturbed pressure at building height
                    pRef 15;        // the dynamic pressure at reference height (usually 10 m)
                    rhoInf              1.2;
                    calcTotal true;
                    calcCoeff true;
                }
};
