Eindhoven_51.44844_5.46475_dir100/100/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 2 -2 0 0 0 0];
#include		"initialConditions";
internalField uniform $turbulentKE;
            boundaryField
{
                frontAndBack
    {
                    type slip;
                }
                outlet
    {
                    type inletOutlet;
                    inletValue uniform $turbulentKE;
                    value       $internalField;
    }
                inlet
                {
                    type atmBoundaryLayerInletK;
                    #include	"ABLConditions";
                }
                ground
    {
                    type kqRWallFunction;
                    value       $internalField;
                }
 ground_perim
    {
                    type kqRWallFunction;
                    value       $internalField;
                }
                building
    {
                    type kqRWallFunction;
                    value       $internalField;
                }
            }

            // ************************************************************************* //
            