Eindhoven_51.44844_5.46475_dir100/100/0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
 | =========                 |                                                 |
 | \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
 |  \\    /   O peration     | Version:  2.2.2                                 |
 |   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
 |    \\/     M anipulation  |                                                 |
 \*---------------------------------------------------------------------------*/
    FoamFile
{
    version     2.0;
    format ascii;
    class volScalarField;
    location    "0";
    object nut;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions [0 2 -1 0 0 0 0];
#include		"initialConditions";
internalField uniform $turbulentKE;
boundaryField
{
    frontAndBack
    {
      	type calculated;
        value uniform 0;
    }
    outlet
    {
	type calculated;
value uniform 0;
    }
    inlet
    {
        type calculated;
value uniform 0;
    }
    ground
    {
        type nutkAtmRoughWallFunction;
#include	"ABLConditions";
value uniform 0;
    }
ground_perim
    {
        type nutkAtmRoughWallFunction;
#include	"ABLConditions";
value uniform 0;
    }
    building
    {
        type nutUSpaldingWallFunction;
value uniform 0;
    }
}

// ************************************************************************* //
